In [1]:
import pandas as pd

##  creating dataframe

In [2]:
#1. from dictionary
data = { 'name':['Alice','Bob','charlie'],'age':[25,30,35]}
df =pd.DataFrame(data)

In [3]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [4]:
df.columns

Index(['name', 'age'], dtype='object')

In [5]:
#2. from list of lists
data =[['Alice',25],['Bob', 30],['charlie', 35]]
df=pd.DataFrame(data)

In [6]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [7]:
df.columns

RangeIndex(start=0, stop=2, step=1)

In [9]:
df.columns= ['name','age']

In [10]:
df.columns

Index(['name', 'age'], dtype='object')

In [11]:
df=pd.DataFrame(data, columns=['name','age'])

In [12]:
df.columns

Index(['name', 'age'], dtype='object')

##   Accessing Data

In [14]:
df['name']

0      Alice
1        Bob
2    charlie
Name: name, dtype: object

In [16]:
type(df['name'])

pandas.core.series.Series

In [17]:
list_col = ['name', 'age']
df[list_col]
#df[['name','age']]

      name  age
0    Alice   25
1      Bob   30
2  charlie   35

##  condition based filtering

In [21]:
df['age']>= 30

0    False
1     True
2     True
Name: age, dtype: bool

In [24]:
df[df['age']>= 30]

      name  age
1      Bob   30
2  charlie   35

In [25]:
df[df['name'].str.startswith('A') & (df['age']>= 25)]

    name  age
0  Alice   25

In [30]:
df['age'].isna()

0    False
1    False
2    False
Name: age, dtype: bool

In [31]:
df[df['age'].isna()]

Empty DataFrame
Columns: [name, age]
Index: []

##  filtering using existing methods

In [32]:
df.loc[0, 'name']

'Alice'

In [33]:
df.loc[0:1, ['name','age']]

    name  age
0  Alice   25
1    Bob   30

In [36]:
df.iloc[0,0]

'Alice'

In [37]:
df.iloc[0:1,[0,1]]

    name  age
0  Alice   25

In [38]:
df.at[0,'name']

'Alice'

In [42]:
df.iat[0,0]

'Alice'

##  Reading and Writing data

In [46]:
# C:\Users\HP\Desktop\datascience\vrit\data.csv
df= pd.read_csv('./../data.csv')

In [47]:
df

    name  age
0  Alice   25
1    Bob   30

In [49]:
df.loc[2, 'name']= 'charlie'
df.loc[2, 'age']= 34

In [50]:
df

      name   age
0    Alice  25.0
1      Bob  30.0
2  charlie  34.0

In [51]:
df.to_csv('./../data.csv', index=False)

##  Data exploration

In [52]:
df.head()

      name   age
0    Alice  25.0
1      Bob  30.0
2  charlie  34.0

In [54]:
df.head(2)

    name   age
0  Alice  25.0
1    Bob  30.0

In [55]:
df.tail(2)

      name   age
1      Bob  30.0
2  charlie  34.0

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      float64
dtypes: float64(1), object(1)
memory usage: 180.0+ bytes

In [57]:
df.describe()

             age
count   3.000000
mean   29.666667
std     4.509250
min    25.000000
25%    27.500000
50%    30.000000
75%    32.000000
max    34.000000

In [58]:
df.value_counts()

name     age
Alice    25.0    1
Bob      30.0    1
charlie  34.0    1
Name: count, dtype: int64

In [59]:
df['age'].nunique()

3

In [60]:
df.shape

(3, 2)

In [61]:
df.isnull()

    name    age
0  False  False
1  False  False
2  False  False

In [62]:
df.isnull().sum()

name    0
age     0
dtype: int64